eldarkg/emdr1986x-std-per-lib/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_adc.h
/**
  ******************************************************************************
  * @file    MDR32F9Qx_adc.h
  * @author  Phyton Application Team
  * @version V1.3.0
  * @date    21/07/2011
  * @brief   This file contains all the functions prototypes for the ADC
  *          firmware library.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, PHYTON SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 Phyton</center></h2>
  ******************************************************************************
  * FILE MDR32F9Qx_adc.h
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32F9QX_ADC_H
#define __MDR32F9QX_ADC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "MDR32F9Qx_config.h"
#include "MDR32F9Qx_lib.h"

/** @addtogroup __MDR32F9Qx_StdPeriph_Driver MDR32F9Qx Standard Peripherial Driver
  * @{
  */

/** @addtogroup  ADC ADC
  * @{
  */

/** @defgroup ADC_Exported_Types ADC Exported Types
  * @{
  */

/**
  * @brief  ADC Init structure definition
  */

typedef struct {
#if defined (USE_MDR1986VE9x)
	uint32_t ADC_SynchronousMode; 		/*!< Enables or disables the ADC1, ADC2 synchronous mode operation.
	 	 	 	 	 	 	 	 	 	 	 This parameter can be a value of @ref ADC_Synchronous_Mode */
#endif

	uint32_t ADC_StartDelay; 			/*!< Specifies the ADC1 and ADC2 conversion start delay.
	 	 	 	 	 	 	 	 	 	 	 This parameter can be a number between 0 and 15. */

	uint32_t ADC_TempSensor; 			/*!< Enables or disables the temperature sensor and internal voltage reference.
	 	 	 	 	 	 	 	 	 	 	 This parameter can be a value of @ref ADC_Temp_Sensor */

	uint32_t ADC_TempSensorAmplifier; 	/*!< Enables or disables the temperature sensor and internal voltage
	 	 	 	 	 	 	 	 	 	 	 reference amplifier.
	 	 	 	 	 	 	 	 	 	 	 This parameter can be a value of @ref ADC_Temp_Sensor_Amplifier */

	uint32_t ADC_TempSensorConversion; 	/*!< Enables or disables the temperature sensor conversion.
	 	 	 	 	 	 	 	 	 	 	 This parameter can be a value of @ref ADC_Temp_Sensor_Conversion */

	uint32_t ADC_IntVRefConversion; 	/*!< Enables or disables the internal voltage reference conversion.
	 	 	 	 	 	 	 	 	 	 	 This parameter can be a value of @ref ADC_Int_VRef_Conversion */

	uint32_t ADC_IntVRefTrimming; 		/*!< Configures the internal voltage reference trimming.
	 	 	 	 	 	 	 	 	 	 	 This parameter can be a number between 0 and 7. */
#if defined (USE_MDR1986VE1T) || defined (USE_MDR1986VE3)
	uint32_t ADC_IntVRefAmplifier;		/*!< Enable or disable the internal voltage reference amplifier.
											 This parameter can be a value of @ref ADC_Int_VRef_Amlifier */
#endif

} ADC_InitTypeDef;

/**
  * @brief  ADC1, ADC2 Init structure definition
  */

typedef struct
{
  uint32_t ADC_ClockSource;             /*!< Specifies the ADCx clock source.
                                             This parameter can be a value of @ref ADCx_Clock_Source */

  uint32_t ADC_SamplingMode;            /*!< Specifies the ADCx sampling mode.
                                             This parameter can be a value of @ref ADCx_Sampling_Mode */

  uint32_t ADC_ChannelSwitching;        /*!< Enables or disables the ADCx channel switching.
                                             This parameter can be a value of @ref ADCx_Channel_Switching */

  uint32_t ADC_ChannelNumber;           /*!< Specifies the ADCx channel number.
                                             This parameter can be a value of @ref ADCx_Channel_Number */

  uint32_t ADC_Channels;                /*!< Specifies the ADCx channels mask.
                                             This parameter can be a value of @ref ADCx_Channels */

  uint32_t ADC_LevelControl;            /*!< Enables or disables the ADCx level control.
                                             This parameter can be a value of @ref ADCx_Level_Control */

  uint16_t ADC_LowLevel;                /*!< Specifies the ADCx value low level.
                                             This parameter can be a number between 0x0000 and 0x07FF. */

  uint16_t ADC_HighLevel;                /*!< Specifies the ADCx value high level.
                                             This parameter can be a number between 0x0000 and 0x07FF. */

  uint32_t ADC_VRefSource;              /*!< Specifies the ADCx voltage reference source (internal or external).
                                             This parameter can be a value of @ref ADCx_VRef_Source */

  uint32_t ADC_IntVRefSource;           /*!< Specifies the ADCx internal voltage reference source (inexact or exact).
                                             This parameter can be a value of @ref ADCx_Int_VRef_Source */

  uint32_t ADC_Prescaler;               /*!< Specifies the ADCx Prescaler configuration.
                                             This parameter can be a value of @ref ADCx_Prescaler */

  uint32_t ADC_DelayGo;                 /*!< Specifies the ADCx start conversion delay at sequential conversion mode.
                                             This parameter can be a number between 0 and 7. */
}ADCx_InitTypeDef;

/** @} */ /* End of group ADC_Exported_Types */

/** @defgroup ADC_Exported_Constants ADC Exported Constants
  * @{
  */

#if defined (USE_MDR1986VE9x)

/** @defgroup ADC_Synchronous_Mode ADC Synchronous Mode
  * @{
  */

